In [56]:
#Creating a DataFrame
#Selecting rows and columns
#Create New Columns
#Drop Coulmns and Rows
#Returning Subsets of the Dataframe

In [57]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [58]:
# Creating a DataFrame
boob = pd.DataFrame(randn(5,3),[1,2,3,4,5], ['A','B','C'])
boob

          A         B         C
1 -0.409318  0.343539  0.196275
2 -0.982776  2.231555 -0.971393
3 -1.522333  1.133703  0.528187
4  0.393461 -0.630507 -1.398290
5 -0.219311 -0.045676  0.012421

In [59]:
# Selecting Column B
boob['B']

1    0.343539
2    2.231555
3    1.133703
4   -0.630507
5   -0.045676
Name: B, dtype: float64

In [60]:
# Creating A New Column
boob['D'] = boob['B'] - boob['C']
boob['D']

1    0.147264
2    3.202948
3    0.605516
4    0.767783
5   -0.058097
Name: D, dtype: float64

In [61]:
# Selecting Row 3
# Label-Based index Location
boob.loc[3]

A   -1.522333
B    1.133703
C    0.528187
D    0.605516
Name: 3, dtype: float64

In [62]:
#Using the Index of the label
boob.iloc[2]

A   -1.522333
B    1.133703
C    0.528187
D    0.605516
Name: 3, dtype: float64

In [63]:
# Dropping A Column
boob.drop('A', axis = 1)

          B         C         D
1  0.343539  0.196275  0.147264
2  2.231555 -0.971393  3.202948
3  1.133703  0.528187  0.605516
4 -0.630507 -1.398290  0.767783
5 -0.045676  0.012421 -0.058097

In [64]:
# Dropping A Row
boob.drop(4)

          A         B         C         D
1 -0.409318  0.343539  0.196275  0.147264
2 -0.982776  2.231555 -0.971393  3.202948
3 -1.522333  1.133703  0.528187  0.605516
5 -0.219311 -0.045676  0.012421 -0.058097

In [65]:
# Returning/Selecting Subsets
# A Single Row and Column
boob.loc[3, 'B']

1.1337029907766036

In [55]:
# Returning more than a row and a column
boob.loc[[2,4], ['C', 'A']]

          C         A
2 -1.560931  0.243178
4  0.674485  0.200780